# Chapter 06 데이터 로딩과 저장, 파일 형식

### 6.1 텍스트 파일에서 데이터를 읽고 쓰는 법

In [4]:
import pandas as pd
import numpy as np

In [5]:
!type "examples\ex1.csv"

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [7]:
df = pd.read_csv('examples\ex1.csv')

In [8]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
pd.read_table('examples\ex1.csv',sep=',')  # 구분자를 쉼표로 지정해서 csv파일을 읽어옴

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
!type "examples\ex2.csv"

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [12]:
pd.read_csv('examples\ex2.csv', header = None)  # 헤더 지정안함

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [14]:
pd.read_csv('examples\ex2.csv', names = ['a','b','c','d','message']) # names를 이용해서 헤더 설정

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [15]:
names = ['a','b','c','d','message']  #헤더값 데이터

In [17]:
 # index_col을 이용해 message 이름을 가진 컬럼을 지정해서 색인으로 만듬
pd.read_csv('examples\ex2.csv',names=names,index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [19]:
!type "examples\csv_mindex.csv"

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [20]:
parsed = pd.read_csv('examples\csv_mindex.csv', index_col = ['key1','key2'])  # 계층적 색인 지정

In [21]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [28]:
list(open('examples\ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [29]:
result = pd.read_table('examples/ex3.txt',sep='\s+')  # \s+ == 공백 문자

In [30]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [33]:
!type "examples\ex4.csv"

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [37]:
pd.read_csv('examples\ex4.csv', skiprows = [0,2,3])  # skiprows를 이용해 생략할 로우 설정

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [38]:
!type "examples\ex5.csv"

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [39]:
result = pd.read_csv('examples\ex5.csv')

In [40]:
result  # NA, 공백 == Nan값으로

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [41]:
result = pd.read_csv('examples\ex5.csv', na_values = ['NULL'])  # na_values == 누락된 값 처리 옵션

In [42]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [45]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [46]:
pd.read_csv('examples\ex5.csv',na_values = sentinels)  #message->foo, Na || something-> two 를 NaN 값으로

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

6.1.1 텍스트 파일 조금씩 읽어오기

In [48]:
pd.options.display.max_rows = 10    # 최대 10개의 데이터만 출력

In [49]:
result =pd.read_csv('examples\ex6.csv')

In [50]:
result # 중간 데이터는 생략 총 10개의 데이터 출력

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [52]:
pd.read_csv('examples\ex6.csv', nrows= 5)  # nrows == 처음부터 @줄을 읽는 옵션

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [73]:
chunker = pd.read_csv('examples\ex6.csv', chunksize = 1000)  
#chunksize 한번에 읽을 파일의 크기, 로우개수를 준다. 여러조각으로 나누어서 읽는다는게 무슨 뜻?

In [74]:
chunker

In [75]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value = 0) # value_count: 값이 나온횟수를 카운트
    # key의 요소들이 나온 횟수를 카운트하여 추가한다.
tot = tot.sort_values(ascending = False)

D:\Download\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

In [78]:
tot[:10] # E는 368번 X는364번 나왔다는 의미 ?

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

6.1.2 데이터를 텍스트 형식으로 기록하기

In [80]:
data = pd.read_csv('examples\ex5.csv')

In [81]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [82]:
data.to_csv('examples\out.csv') #to_csv: 쉼표로 구분된 형식으로 파일에 쓸 수 있음

In [83]:
!type "examples\out.csv"

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [84]:
import sys

In [85]:
data.to_csv(sys.stdout, sep = '|') # |로 구분, sys.stdout은 정확히 무엇을 의미하는거지?

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [86]:
data.to_csv(sys.stdout, na_rep = 'NULL')  # 누락된 값은 NULL 로 설정

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [87]:
data.to_csv(sys.stdout, index = False, header = False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [89]:
data.to_csv(sys.stdout, index = False, columns = ['a','b','c']) # a,b,c 열 출력

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [10]:
dates = pd.date_range('1/1/2000', periods =7)

In [11]:
ts = pd.Series(np.arange(7), index = dates)

In [12]:
ts.to_csv('examples/tseries.csv') # 왜 오류가 뜨지?

In [13]:
!type "examples\tseries.csv"

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

6.1.3 구분자 형식 다루기

In [110]:
!type "examples\ex7.csv"

"a","b","c"
"1","2","3"
"1","2","3"

In [22]:
import csv

In [23]:
f= open('examples\ex7.csv')
reader = csv.reader(f)   # reader 순회시 큰 따옴표가 제거된 튜플을 얻을 수 있다

In [24]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [25]:
with open('examples/ex7.csv')as f:
    lines = list(csv.reader(f))

In [26]:
header, values = lines[0],lines[1:]

In [27]:
# 리스트 표기법 이용. zip을 이용해 헤더와 값을 묶어줌, h 는 key, v는 value로 사전 생성   || *value는 무엇을 뜻하는거지? 
data_dict = {h: v for h,v in zip(header, zip(*values))}

In [28]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [29]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [30]:
reader = csv.reader(f, dialect=my_dialect)

TypeError: argument 1 must be an iterator

In [31]:
reader = csv.reader(f, delimiter = '|')

TypeError: argument 1 must be an iterator

In [32]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect = my_dialect)
    writer.writerow(('one','two','three'))
    writer.writerow(('1','2','3'))
    writer.writerow(('4','5','6'))
    writer.writerow(('7','8','9'))

6.1.4 JSON 데이터

In [34]:
obj = """
{"name": "Wes",
"places_lived": ["united States", "Spain","Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age":30, "pets":["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets":["Sixes","Stache","Cisco"]}]
}
"""

In [35]:
import json

In [36]:
result = json.loads(obj)

In [37]:
result

{'name': 'Wes',
 'places_lived': ['united States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [38]:
ajson = json.dumps(result)

In [39]:
ajson

'{"name": "Wes", "places_lived": ["united States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [141]:
siblings = pd.DataFrame(result['siblings'], columns = ['name','age'])

In [142]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [143]:
!type "examples\example.json"

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [144]:
data = pd.read_json('examples\example.json')

In [145]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [146]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [147]:
print(data.to_json(orient = 'records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

6.1.5 XML과 HTML: 웹 스크래핑

In [149]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [150]:
len(tables)

1

In [151]:
failures = tables[0]

In [152]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [153]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [154]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

### 6.2 이진 데이터 형식

In [155]:
frame = pd.read_csv('examples/ex1.csv')

In [156]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [157]:
frame.to_pickle('examples/frame_pickle')

In [158]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

3.2.1 HDF5 형식 사용하기

In [41]:
frame = pd.DataFrame({'a':np.random.randn(100)})

In [42]:
store = pd.HDFStore('mydata.h5')

In [43]:
store['obj1'] = frame

In [44]:
store['obj1_col'] = frame['a']

In [45]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [46]:
store['obj1']

           a
0   1.189220
1  -0.304277
2   1.568443
3   0.918123
4   0.049369
..       ...
95 -0.348672
96  2.050106
97 -1.158599
98  0.716483
99 -1.569402

[100 rows x 1 columns]

In [47]:
store.put('obj2', frame, format = 'table')

In [48]:
store.select('obj2', where = ['index >= 10 and index <= 15'])

           a
10 -0.306910
11  1.681561
12  1.003022
13 -0.182230
14  1.419472
15  0.348836

In [49]:
store.close()

In [169]:
frame.to_hdf('mydata.h5','obj3',format = 'table')

In [170]:
pd.read_hdf('mydata.h5','obj3',where=['index <5'])

          a
0 -0.746536
1 -0.628924
2 -0.149054
3  0.055447
4  0.441300

6.2.2 마이크로소프트 엑셀 파일에서 데이터 읽어오기

In [176]:
xlsx = pd.ExcelFile('examples\ex1.xlsx')

In [177]:
pd.read_excel(xlsx,'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [178]:
frame = pd.read_excel('examples\ex1.xlsx','Sheet1')

In [179]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [180]:
writer = pd.ExcelWriter('examples\wx2.xlsx')

In [181]:
frame.to_excel(writer, 'Sheet1')

In [182]:
writer.save()

In [183]:
frame.to_excel('examples\ex2.xlsx')

### 6.3 웹 API와 함께 사용하기

In [184]:
import requests

In [185]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [186]:
resp = requests.get(url)

In [187]:
resp

In [188]:
data = resp.json()

In [189]:
data[0]['title']

'MAINT: Fix issue in StataReader due to upstream changes'

In [190]:
issues = pd.DataFrame(data, columns = ['number','title','labels','state'])

In [191]:
issues

,number,title,labels,state
0,35427,MAINT: Fix issue in StataReader due to upstrea...,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
1,35426,CI/COMPAT: read_stata failing in numpy dev pip...,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
2,35425,BUG: attrs lost for Series in DataFrame,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
3,35424,TST: adding test for .describe() with duplicat...,"[{'id': 697792067, 'node_id': 'MDU6TGFiZWw2OTc...",open
4,35423,TST: Add test for `GroupBy.describe()` with du...,"[{'id': 697792067, 'node_id': 'MDU6TGFiZWw2OTc...",open
...,...,...,...,...
25,35394,BUG: UnboundLocalError on `df.to_string(max_ro...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
26,35392,BUG: Index.get_indexer_non_unique misbehaves w...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
27,35389,ENH: Request for `Index.to_string` & `MultiInd...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
28,35388,BUG: timezone-aware DatetimeIndex doesn't hand...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
29,35387,Display dataframe name or title when using dis...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open

### 6.4 데이터베이스와 함께 사용하기

In [192]:
import sqlite3

In [193]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
c REAL, d INTEGER);"""

In [194]:
con = sqlite3.connect('mydata.sqlite')

In [195]:
con.execute(query)

In [196]:
con.commit()

In [197]:
data = [('Atlanta','Georgia',1.25,6),
       ('Tallahassee','Florida', 2.6,3),
       ('Sacramento','California', 1.7, 5)]

In [198]:
stmt = "INSERT INTO test VALUES(?,?,?,?)"

In [199]:
con.executemany(stmt, data)

In [200]:
con.commit()

In [201]:
cursor = con.execute('select * from test')

In [202]:
rows = cursor.fetchall()

In [203]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [204]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [205]:
pd.DataFrame(rows, columns = [x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [206]:
import sqlalchemy as sqla

In [207]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [208]:
pd.read_sql('select * from test',db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5